CSI API ETABS v1
cFrameObj.SetEndLengthOffset Method
 Assigns frame object end offsets along the 1-axis of the object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetEndLengthOffset(
	string Name,
	bool AutoOffset,
	double Length1,
	double Length2,
	double RZ,
	eItemType ItemType = eItemType.Objects
)
Function SetEndLengthOffset (
	Name As String,
	AutoOffset As Boolean,
	Length1 As Double,
	Length2 As Double,
	RZ As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim AutoOffset As Boolean
Dim Length1 As Double
Dim Length2 As Double
Dim RZ As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetEndLengthOffset(Name,
	AutoOffset, Length1, Length2, RZ,
	ItemType)
int SetEndLengthOffset(
	String^ Name,
	bool AutoOffset,
	double Length1,
	double Length2,
	double RZ,
	eItemType ItemType = eItemType::Objects
)
abstract SetEndLengthOffset :
        Name : string *
        AutoOffset : bool *
        Length1 : float *
        Length2 : float *
        RZ : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
AutoOffset
Type: System.Boolean
 If this item is True, the end length offsets are automatically determined by the program from object connectivity, and the Length1, Length2 and RZ items are ignored.
Length1
Type: System.Double
 The offset length along the 1-axis of the frame object at the I-End of the frame object. [L]
Length2
Type: System.Double
 The offset length along the 1-axis of the frame object at the J-End of the frame object. [L]
RZ
Type: System.Double
 The rigid zone factor. This is the fraction of the end offset length assumed to be rigid for bending and shear deformations.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the offsets are successfully assigned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign offsets
   ret = SapModel.FrameObj.SetEndLengthOffset("15", False, 12, 12, 0.5)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace